; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 982302 2 3 3 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation6 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star7)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
)
(:goal (and
	(have_image Planet8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 infrared2)
	(have_image Star11 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
3. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 4
4. (calibrate satellite1 instrument4 groundstation6)
   added: (calibrated instrument4)
   goals met: 0 of 4
5. (turn_to satellite0 star11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star11)
   goals met: 0 of 4
6. (turn_to satellite1 planet9 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet9)
   goals met: 0 of 4
7. (take_image satellite1 planet9 instrument4 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 1 of 4
8. (take_image satellite0 star11 instrument1 infrared2)
   added: (have_image star11 infrared2)
   goals met: 2 of 4
9. (turn_to satellite0 planet10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 4
10. (turn_to satellite1 planet8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet8)
   goals met: 2 of 4
11. (take_image satellite1 planet8 instrument4 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 3 of 4
12. (take_image satellite0 planet10 instrument1 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 4 of 4
